app/controllers/gossips_controller.rb

  def edit
    @gossip = Gossip.all.find_by(id:params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def show
    @gossip = Gossip.all.find_by(id: params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]

  def destroy
    @gossip = Gossip.find(params[:id])
    if @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 30]]