app/controllers/index_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def home
    @gossips = Gossip.all

SELECT "gossips".* FROM "gossips"
---
  def welcome
    @gossips = Gossip.all